# Объявляем класс (шаблон) Graph, внутри которого будут храниться данные и команды для работы с графом (как устроен объект и что умеет делать)
class Graph:

    # Инициализация, запускается при создании нового графа Graph() и задает его начальные параметры (список self.matrix)),куда загружается таблица смежности
    def init(self):
        # Создаем внутри графа пустой список matrix - сюда запишется таблица смежности
        self.matrix = []

    #Чтение матриц из файла
        
    # Создаем команду для чтения load_from_file, (self) - в какой граф заполняем матрицу;(filename) - из какого файла читать матрицу
    def load_from_file(self, filename):
        # Очищаем список матрицы, записывая пустой список
        self.matrix = []
        
        # Открываем текстовый файл, читаем данные
        with open(filename, 'r') as file:
            # Берем из файла одну текстовую строчку за другой
            for line in file:
                # Разрезаем строчку по пробелам на отдельные кусочки текста (получаем список символов)
                pieces = line.split() 
                # Создаем пустой список под первую строку (создается из разрезанных кусочков)
                row = [] 
                # Каждый кусочек конвертируем в числовой тип данных из строкового
                for piece in pieces:
                    number = int(piece)   
                    # Добавляем это число в конец строки row
                    row.append(number)    
                # Собранную числовую строку добавляем в общую таблицу графа self.matrix
                self.matrix.append(row)
            #Циклы повторяются, пока весь файл не будет прочитан (не закончатся элементы)
                
        # Вывод
        print("Прочитан файл:", filename)

    #Проверка на изоморфизм
    
    # Создаем команду для сравнения check_isomorphism, которая сравнивает текущий граф (self) со вторым графом (other_graph)
    def check_isomorphism(self, other_graph):
        # проверка на равенство размеров матриц
        if len(self.matrix) != len(other_graph.matrix):
            return False
        # Записываем размер матрицы (количество вершин) в size
        size = len(self.matrix)
        # сюда будем складывать степени вершин первого графа
        degrees1 = []
        # сюда второго
        degrees2 = []
        
        # i и j меняются от 0 до size-1,заходим по очереди в каждую строку 
        for i in range(size):
            # Обнуляем счетчик связей (степень вершины) для текущей строки первого графа
            sum1 = 0
            # Обнуляем для второго
            sum2 = 0
            for j in range(size):
                # Достаем число из строки i и столбца j первого графа
                val1 = self.matrix[i][j]
                # и из второго 
                val2 = other_graph.matrix[i][j]
                
                # Прибавляем найденное число (0 или 1) к сумме текущей строки первого графа (для получения степени вершины) 
                sum1 = sum1 + val1
                # Прибавляем к сумме строки второго
                sum2 = sum2 + val2
                
            # Когда строка i пройдена до конца, сохраняем готовую сумму первого графа в список degrees1
            degrees1.append(sum1)
            # Сохраняем готовую сумму строки второго
            degrees2.append(sum2)

        # Сортируем список степеней первого графа по возрастанию (выстраиваем числа, степени)
        degrees1.sort()
        # и второго
        degrees2.sort()

        # сравниваем оба отсортированных списка, изоморфны если равны
        if degrees1 == degrees2:
            #возвращаем ответ True
            return True
        else:
            #возвращаем ответ False
            return False

#1. Сравнение количества вершин, рахное количество автоматически означает неизоморфность
#2. Подсчет степеней вершин
#3. Одинаковое количество связей означает изоморфность обоих графов

#Создание объектов графов
        
# Создаем объект для первого графа по шаблону Graph, под него выделяется память и вызывается конструктор init, который подготавливает список (список self.matrix) для него
graph1 = Graph()
# и для второго 
graph2 = Graph()

# Загрузка матриц из файлов

# Читвем матрицу для первого графа из файла input1.txt
graph1.load_from_file('input1.txt')
# аналогично для второго
graph2.load_from_file('input2.txt')

#Вывод ответа

# Запускаем команду сравнения graph1 и graph2
if graph1.check_isomorphism(graph2) == True:
    print("\nГрафы изоморфны")
else:
    print("\nГрафы не изоморфны")
print("\nЗавершено.")
